# Организовать словарь на 10 англо-русских слов, обеспечивающий
# "перевод" английского слова на русский.
a = {"cow":"корова","cat":"кошка","dog":"собака","human":"человек","spider":"паук","bee":"пчела","horse":"лошадь","deer":"олень","frog":"лягушка","beetle":"жук"}
print('В словаре есть слова "cow","cat","dog","human","spider","bee","horse","deer","frog","beetle",')
slovo = input('Введите слово, которое хотите перевести: ')
while slovo not in a:
    print('Такого слова нет в списке!')
    slovo = input('Введите слово, которое хотите перевести: ')
print(a[slovo])
