turisti_info = [
    (1, 'Артем', 'Петров', 'М', '2000-12-03', '+79185378142', 'siwilaufrouna-1434@yopmail.com'),
    (2, 'Мария', 'Большакова', 'Ж', '2001-02-15', '+79189599408', 'xeuttemufepeu-8617@yopmail.com'),
    (3, 'Валерия', 'Клюева', 'Ж', '1999-04-12', '89189040467', 'freuhallifrevu-3387@yopmail.com'),
    (4, 'Кирилл', 'Хохлов', 'М', '2001-01-30', '89189040467', 'gesugefrulau-1893@yopmail.com'),
    (5, 'Варвара', 'Родина', 'Ж', '1970-04-12', '+79189040467', 'luceuwoxuzi-3189@yopmail.com'),
    (6, 'Мира', 'Ковалева', 'Ж', '1999-04-12', '+79189040467', 'baufebeuruffu-4667@yopmail.com'),
    (7, 'Екатерина', 'Киселева', 'Ж', '1988-04-12', '89189040467', 'treiquoffatrauza-4847@yopmail.com'),
    (8, 'Александра', 'Коровина', 'Ж', '1999-04-12', '89189040467', 'fraufelletehou-2802@yopmail.com'),
    (9, 'Тимофей', 'Титов', 'М', '1976-04-12', '89189040467', 'fougeikoicefa-5867@yopmail.com'),
    (10, 'Захар', 'Воронцов', 'М', '2003-04-12', '89189040467', 'weibrazeppuyeu-3646@yopmail.com')
]

turi_info = [
    (1, 'Питерские мосты, музеи и галереи', 'Россия', 'Санкт-Петербург', '2012-12-23', '2013-01-12', 4765.55),
    (2, 'Кемп-лагерь', 'Россия', 'Кубань', '2015-07-23', '2015-08-10', 23765.55),
    (3, 'Свег-тур', 'Россия', 'Москва', '2017-07-20', '2017-08-03', 21235.50),
    (4, 'Крымские достопримечательности', 'Россия', 'Судак', '2017-06-20', '2017-06-30', 3235.55),
    (5, 'Испания-путешествие по городам', 'Испания', 'Барселона', '2018-06-20', '2018-06-28', 48235.55),
    (6, 'Alva Donna Exclusive', 'Турция', 'Белек', '2018-06-12', '2018-07-14', 43235.25),
    (7, 'Греция-отдых на море', 'Греция', 'Афины', '2018-06-04', '2018-07-05', 43434.45),
    (8, 'Genoni', 'Турция', 'Аланья', '2021-06-02', '2021-07-02', 89235.55),
    (9, 'Forward"s bALL', 'Турция', 'Белек', '2022-06-08', '2022-07-14', 89235.45),
    (10, 'Luca shock', 'Турция', 'Белек', '2022-06-08', '2022-07-10', 90276.65)
]
broni_info = [
    (1, 2, 3, '2017-06-23', 2),
    (2, 1, 5, '2018-05-23', 20),
    (3, 6, 1, '2012-11-10', 1),
    (4, 3, 6, '2018-05-05', 15),
    (5, 7, 2, '2015-04-08', 4),
    (6, 5, 4, '2017-05-23', 45),
    (7, 4, 9, '2022-05-18', 1),
    (8, 8, 7, '2018-03-13', 43),    
    (9, 10, 8, '2021-02-09', 12),
    (10, 9, 10, '2022-01-06', 5)
]